/********************************************************************************/
/*                                                                              */
/*                 ‘айл определений дл€ управл€ющей программы                   */
/*                                                                              */
/********************************************************************************/

#ifndef _MAIN_H
#define _MAIN_H

#include "Aduc814.h"
#include "MeasXY_LIB\MeasXY.h"

// прототипы 'c'-функций в файле 'Main.c'
void Tx_means(char* outmeans);
void Tx_byte(char outbyte);

#endif

