/********************************************************************************/
/*                                                                              */
/*                 ‘айл определений дл€ управл€ющей программы                   */
/*                                                                              */
/********************************************************************************/

#ifndef _MAIN_H
#define _MAIN_H

#include "Aduc814.h"

#define XOUT P10
#define YOUT P11

// прототипы 'c'-функций в файле 'Main.c'
void meas_xy(void);
void Tx_means(void);
void Tx_byte(char outbyte);

#endif

